class LuciferMoringstar(object):

    DEFAULT_MSG = """
ഹായ് {mention} സുഖമാണോ,
എന്റെ പേര് [{bot_name}](t.me/{bot_username}), മലയാളം ഡബ്ബ് ചെയ്ത സിനിമകൾ നൽകലാണ് എന്റെ ജോലി എന്നെ നിങ്ങളുടെ ഗ്രൂപ്പിൽ അഡ്മിൻ ആക്കുക, ഞാൻ നിങ്ങളുടെ ഗ്രൂപ്പ് പവർ ആക്കിതരാം..!
കൂടുതൽ വിഷയങ്ങൾക്കായി നോട്ടീസ് ബട്ടണിൽ ക്ലിക്ക് ചെയ്യുക"""

    HELP_MSG = """
<u><b>നോട്ടീസ്സ്</u></b>

• ഈ ബോട്ട് മലയാളം ഡബ്ബ് ചെയ്ത സിനിമകൾക്ക് മാത്രമുള്ളതാണ്, മറ്റ് ഭാഷാ സിനിമകളൊന്നും ഈ ബോട്ടിൽ ലഭ്യമല്ല
• നിങ്ങൾക്ക് ആവശ്യമുള്ള സിനിമയുടെ പേര് നൽകുക, അല്ലെങ്കിൽ എന്നെ നിങ്ങളുടെ ഗ്രൂപ്പിലേക്ക് ചേർക്കുക, നിങ്ങൾക്ക് ആവശ്യമുള്ള സിനിമയ്ക്ക് പേര് നൽകുക.
• മലയാളം ഡബ്ബ് ചെയ്ത പുതിയ സിനിമയുടെ നോട്ടിഫിക്കേഷൻ ലഭിക്കാൻ നോട്ടിഫിക്കേഷൻ ബട്ടണിൽ ക്ലിക്ക് ചെയ്ത് ചാനലിൽ ജോയിൻ ചെയ്യുക."""

    ABOUT_MSG = """
🤖 My Name [{bot_name}](t.me/{bot_username})

🧑 My Dev : [PR0FESS0R-99](t.me/PR0FESS0R_99)

📦 My Source : [Click Here](https://github.com/PR0FESS0R-99/LuciferMoringstar_Robot)

📺 My Tutorial : [Ckick Here](https://youtu.be/FCU_XJmyG_U)

🗃️ My Library : [Pyrogram](https://youtu.be/Af055Eozk9s)

🖇️ My Language : [Python3](https://youtu.be/Af055Eozk9s)

🗃️ My Database : [Mongodb](https://youtu.be/gBLTsH-IXr0)

🗳️ My Server : [Heroku](https://youtu.be/xcZD55td6Vw)

🏷️ My Updates : [Mo Tech](t.me/Mo_Tech_YT)

🗣️ My Support : [Any Doubt](t.me/Mo_Tech_Group)"""

    FILE_CAPTIONS = """Hello 👋 {mention}\n\n📁Title {title}\n\n🔘Size {size}"""

    PR0FESS0R_99 = """
**ADMINS COMMANDS**

 » /broadcast - Reply Any Medi Or Message
 » /delete - Reply Files
 » /deleteall - Delete All Files
 » /total - How Many Files Saved
 » /logger - Get Bot Logs
 » /channel - Add Channel List"""

    ADD_YOUR_GROUP = """**__ഞാൻ ജോലി ചെയ്യുന്ന ഗ്രൂപ്പിൽ ചേരൂ, നിങ്ങൾക്ക് ആവശ്യമുള്ള എല്ലാ സിനിമകളും  ആ ഗ്രൂപ്പിൽ അഭ്യർത്ഥിക്കാം? ഇവിടെ ചോദിക്കരുത്__**"""
    SPELL_CHECK = """
Hello 👋〘 {mention} 〙,

Couldn't Find {query}?  Please Click Your Request Movie Name"""
    GET_MOVIE_1 = """
📽️ Requested Movie : [{query}]({url})
👤 Requested By : {mention}
🎬 Title : [{title}]({url})
📆 Year : {year}
🌟 Rating {rating}/10
🗨️ Genres {genres}"""


    GET_MOVIE_2 = """
📽️ Requested Movie : {query}
👤 Requested By : {mention}

© **{chat}**"""
